---
kind: type
id: T:Autodesk.Revit.DB.FamilyPointPlacementReference
source: html/dc0c37e5-16e7-53eb-0b2c-b399c3230d77.htm
---
# Autodesk.Revit.DB.FamilyPointPlacementReference

This object represents data corresponding to the placement references in a
certain types of Family Instances (see examples listed below).

## Syntax (C#)
```csharp
public class FamilyPointPlacementReference : APIObject
```

## Remarks
Examples of FamilyInstance objects that contain placement references are Panels
and Flexible Components.